In [1]:
import numpy as np
import pandas as pd

In [6]:
# Series is a mutable collection of the same data type
# based on np array
l = [8.0, 7, -5, 3, 99]
o = pd.Series(l)
o

0     8.0
1     7.0
2    -5.0
3     3.0
4    99.0
dtype: float64

In [8]:
o.values

array([ 8.,  7., -5.,  3., 99.])

In [9]:
o.index

RangeIndex(start=0, stop=5, step=1)

In [33]:
vals = [8.0, 7, -5, 3, 35]
ind = ['d', 'b', 'a', 'c', 'e']
s = pd.Series(vals, index=ind)
s

d     8.0
b     7.0
a    -5.0
c     3.0
e    35.0
dtype: float64

In [20]:
s['d'] = 99
s

d    99.0
b     7.0
a    -5.0
c     3.0
e    35.0
dtype: float64

## Slicing series

In [22]:
s['d':'e':2]    # [start:stop:step] - not stop-before!

d    99.0
a    -5.0
e    35.0
dtype: float64

In [28]:
s[1:4]    # [start:stop-before] - using ordinals

b    7.0
a   -5.0
c    3.0
dtype: float64

## logic to get slices

In [27]:
s[s>2]

d    99.0
b     7.0
c     3.0
e    35.0
dtype: float64

In [30]:
s[s<0]

a   -5.0
dtype: float64

In [31]:
s**0.5    # NaN = Not a Numbre

d    9.949874
b    2.645751
a         NaN
c    1.732051
e    5.916080
dtype: float64

In [36]:
sdata = {'Cork':35000, 'Dublin':71000, 'Galway':16000, 'Athlone':5000}
idata = {'Cork', 'Dublin', 'Galway', 'Athlone', 'asdasd'}

p = pd.Series(sdata, index=idata)
p

Cork       35000.0
asdasd         NaN
Galway     16000.0
Athlone     5000.0
Dublin     71000.0
dtype: float64

In [37]:
#------------

In [43]:
towns_l = ['Cork', 'Dublin', 'Galway', 'Athlone', 'Shannon', 'Rosscarbery', 'Athenry']
years_l = [2017, 2018, 2019, 2020, 2021, 2022, 2023]
pop_l   = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 1.7]
data_d    = {'Town':towns_l, 'Year':years_l, 'Pop':pop_l}

In [48]:
df = pd.DataFrame(data_d)
df = pd.DataFrame(data_d, index=towns_l)
df

                    Town  Year  Pop
Cork                Cork  2017  1.5
Dublin            Dublin  2018  1.7
Galway            Galway  2019  3.6
Athlone          Athlone  2020  2.4
Shannon          Shannon  2021  2.9
Rosscarbery  Rosscarbery  2022  3.2
Athenry          Athenry  2023  1.7

In [49]:
df.head(2)

          Town  Year  Pop
Cork      Cork  2017  1.5
Dublin  Dublin  2018  1.7

In [52]:
# only data we're interested it
index_l = ['one', 'two', 'three', 'four', 'five', 'six', 'seven']

df2 = pd.DataFrame(data_d, columns=['Pop', 'Year'], index=towns_l)
df2

             Pop  Year
Cork         1.5  2017
Dublin       1.7  2018
Galway       3.6  2019
Athlone      2.4  2020
Shannon      2.9  2021
Rosscarbery  3.2  2022
Athenry      1.7  2023

In [53]:
# accessing data with loc
# loc = locate rows
df2.loc['Athlone']

Pop        2.4
Year    2020.0
Name: Athlone, dtype: float64

In [59]:
# df2['Athlone']    # not a Series
df2['Pop']    # get column

Cork           1.5
Dublin         1.7
Galway         3.6
Athlone        2.4
Shannon        2.9
Rosscarbery    3.2
Athenry        1.7
Name: Pop, dtype: float64

In [60]:
df2.loc['Shannon']    # get row

Pop        2.9
Year    2021.0
Name: Shannon, dtype: float64

In [61]:
df2.iloc[3]    # get row by underlying ordinal position (0-indexed)

Pop        2.4
Year    2020.0
Name: Athlone, dtype: float64

In [62]:
# ---- lunch ----

In [63]:
i = ['Waterford', 'Clonakilty', 'Athenry', 'Meath']
c = ['red', 'green', 'gold', 'white']

df4 = pd.DataFrame(np.arange(16).reshape(4, 4), index=i, columns=c)
df4

            red  green  gold  white
Waterford     0      1     2      3
Clonakilty    4      5     6      7
Athenry       8      9    10     11
Meath        12     13    14     15

In [66]:
which_row = df4[df4['gold'] == 6]
which_row

            red  green  gold  white
Clonakilty    4      5     6      7

In [71]:
df4.loc['Clonakilty']['green'] = 55
df4

            red  green  gold  white
Waterford     0      1     2      3
Clonakilty    4     55     6      7
Athenry       8      9    10     11
Meath        12     13    14     15

In [73]:
df4.iloc[1]['white'] = 99
df4

            red  green  gold  white
Waterford     0      1     2      3
Clonakilty    4     55     6     99
Athenry       8      9    10     11
Meath        12     13    14     15